Shinku-Chen/ai-passport/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 3 MB 应用上限与小程序 BLE Recovery 安装器保持一致。分区表
# 还固定保留 cardid@0x356000 与 recovery@0x700000，二创不得改动。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# 开机持续按住上键（GPIO0）5 秒，由自定义 bootloader 跳转到工厂
# 预装的 0x700000 Recovery。这些选项为 bootloader 提供长按检测配置。
CONFIG_BOOTLOADER_FACTORY_RESET=y
CONFIG_BOOTLOADER_NUM_PIN_FACTORY_RESET=0
CONFIG_BOOTLOADER_FACTORY_RESET_PIN_LOW=y
CONFIG_BOOTLOADER_OTA_DATA_ERASE=y
CONFIG_BOOTLOADER_DATA_FACTORY_RESET=""
CONFIG_BOOTLOADER_HOLD_TIME_GPIO=5

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- 深睡省电: 关掉唤醒 IO 的内部上拉/下拉 ---
# 本板 GPIO0 按键唤醒靠【外部 10kΩ 上拉】, 内部上拉纯属冗余且会在外部上拉之上
# 叠加一条泄漏路径(硬件指南/经验文档均指出)。该配置默认 y, 这里显式关闭。
CONFIG_ESP_SLEEP_GPIO_ENABLE_INTERNAL_RESISTORS=n

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# UI 本身简单, 小池够; 但 FAP_SCREENSHOT_V1 社区发布协议需 lv_snapshot_take 一次分配
# 全屏 RGB565(240x320x2 ≈ 153KB), 故调到能容纳全屏快照。若日后移除截图协议可调回 24。
CONFIG_LV_MEM_SIZE_KILOBYTES=180
# 启用对象截图 API(lv_snapshot_take), 用于把任意 LVGL 对象渲染到指定缓冲作像素导出。
# 无额外依赖; 若只需整屏截图, 也可联用 LV_USE_SNAPSHOT。
CONFIG_LV_USE_SNAPSHOT=y

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# --- Bluetooth LE / NimBLE ---
# 音效钥匙扣产品 App 不使用 BLE(开机直接进三层 UI), 故关掉蓝牙栈:
# 省内存、减少镜像体积、消除潜在功耗。若日后要 BLE 再单独启用。
# 深睡会断电 HP 域(含蓝牙控制器), 所以深睡时蓝牙本就关闭; 这里关闭是省运行期资源。
CONFIG_BT_ENABLED=n
# CONFIG_BT_NIMBLE_ENABLED is not set

# --- 按键(espressif/button)消抖/采样调优: 去抖动、减少误触 ---
# 扫描周期 5ms + 消抖 4 tick = 20ms 确认; ADC 3 次采样平均滤噪声。
CONFIG_BUTTON_DEBOUNCE_TICKS=4
CONFIG_ADC_BUTTON_SAMPLE_TIMES=3
